In [1]:
#import thư viện
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import os

In [16]:
pip install folium

Collecting folium
  Downloading folium-0.19.6-py2.py3-none-any.whl.metadata (4.1 kB)
Collecting branca>=0.6.0 (from folium)
  Downloading branca-0.8.1-py3-none-any.whl.metadata (1.5 kB)
Collecting jinja2>=2.9 (from folium)
  Downloading jinja2-3.1.6-py3-none-any.whl.metadata (2.9 kB)
Requirement already satisfied: numpy in c:\users\fptsh\appdata\local\programs\python\python312\lib\site-packages (from folium) (1.26.4)
Requirement already satisfied: requests in c:\users\fptsh\appdata\local\programs\python\python312\lib\site-packages (from folium) (2.32.3)
Collecting xyzservices (from folium)
  Downloading xyzservices-2025.4.0-py3-none-any.whl.metadata (4.3 kB)
Requirement already satisfied: MarkupSafe>=2.0 in c:\users\fptsh\appdata\local\programs\python\python312\lib\site-packages (from jinja2>=2.9->folium) (3.0.2)
Requirement already satisfied: charset-normalizer<4,>=2 in c:\users\fptsh\appdata\local\programs\python\python312\lib\site-packages (from requests->folium) (3.4.0)
Requirement already satisfied: idna<4,>=2.5 in c:\users\fptsh\appdata\local\programs\python\python312\lib\site-packages (from requests->folium) (3.10)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\users\fptsh\appdata\local\programs\python\python312\lib\site-packages (from requests->folium) (2.2.3)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\fptsh\appdata\local\programs\python\python312\lib\site-packages (from requests->folium) (2024.12.14)
Downloading folium-0.19.6-py2.py3-none-any.whl (112 kB)
   ---------------------------------------- 0.0/112.5 kB ? eta -:--:--
   ---------------------------------------- 0.0/112.5 kB ? eta -:--:--
   -------------- ------------------------ 41.0/112.5 kB 991.0 kB/s eta 0:00:01
   ---------------------------------- --- 102.4/112.5 kB 980.4 kB/s eta 0:00:01
   ---------------------------------------- 112.5/112.5 kB 1.1 MB/s eta 0:00:00
Downloading branca-0.8.1-py3-none-any.whl (26 kB)
Downloading jinja2-3.1.6-py3-none-any.whl (134 kB)
   ---------------------------------------- 0.0/134.9 kB ? eta -:--:--
   --------------------------------- ------ 112.6/134.9 kB 6.4 MB/s eta 0:00:01
   ---------------------------------------- 134.9/134.9 kB 2.7 MB/s eta 0:00:00
Downloading xyzservices-2025.4.0-py3-none-any.whl (90 kB)
   ---------------------------------------- 0.0/90.4 kB ? eta -:--:--
   ------------------------------------ --- 81.9/90.4 kB 2.3 MB/s eta 0:00:01
   ---------------------------------------- 90.4/90.4 kB 1.7 MB/s eta 0:00:00
Installing collected packages: xyzservices, jinja2, branca, folium
Successfully installed branca-0.8.1 folium-0.19.6 jinja2-3.1.6 xyzservices-2025.4.0
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [17]:
import folium

In [3]:
dataset_dir = 'C:\\Users\\fptsh\\OneDrive - ueh.edu.vn\\Tài liệu\\GitHub\\weather-prediction\\resource\\dataset\\raw'

### LOAD DATA

In [4]:
def load_data(file_path):
    return pd.read_csv(file_path)

In [5]:
humidity = load_data(os.path.join(dataset_dir, 'humidity.csv'))
pressure = load_data(os.path.join(dataset_dir, 'pressure.csv'))
temperature = load_data(os.path.join(dataset_dir, 'temperature.csv'))
wind_direction = load_data(os.path.join(dataset_dir, 'wind_direction.csv'))
wind_speed = load_data(os.path.join(dataset_dir, 'wind_speed.csv'))
city_att = load_data(os.path.join(dataset_dir, 'city_attributes.csv'))
weather_desc = load_data(os.path.join(dataset_dir, 'weather_description.csv'))

#### SHOW DATA

In [6]:
humidity.head()

,datetime,Vancouver,Portland,San Francisco,Seattle,Los Angeles,San Diego,Las Vegas,Phoenix,Albuquerque,...,Philadelphia,New York,Montreal,Boston,Beersheba,Tel Aviv District,Eilat,Haifa,Nahariyya,Jerusalem
0,2012-10-01 12:00:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,25.0,NaN,NaN,NaN
1,2012-10-01 13:00:00,76.0,81.0,88.0,81.0,88.0,82.0,22.0,23.0,50.0,...,71.0,58.0,93.0,68.0,50.0,63.0,22.0,51.0,51.0,50.0
2,2012-10-01 14:00:00,76.0,80.0,87.0,80.0,88.0,81.0,21.0,23.0,49.0,...,70.0,57.0,91.0,68.0,51.0,62.0,22.0,51.0,51.0,50.0
3,2012-10-01 15:00:00,76.0,80.0,86.0,80.0,88.0,81.0,21.0,23.0,49.0,...,70.0,57.0,87.0,68.0,51.0,62.0,22.0,51.0,51.0,50.0
4,2012-10-01 16:00:00,77.0,80.0,85.0,79.0,88.0,81.0,21.0,23.0,49.0,...,69.0,57.0,84.0,68.0,52.0,62.0,22.0,51.0,51.0,50.0

In [7]:
temperature.head()

,datetime,Vancouver,Portland,San Francisco,Seattle,Los Angeles,San Diego,Las Vegas,Phoenix,Albuquerque,...,Philadelphia,New York,Montreal,Boston,Beersheba,Tel Aviv District,Eilat,Haifa,Nahariyya,Jerusalem
0,2012-10-01 12:00:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,309.100000,NaN,NaN,NaN
1,2012-10-01 13:00:00,284.630000,282.080000,289.480000,281.800000,291.870000,291.530000,293.410000,296.600000,285.120000,...,285.630000,288.220000,285.830000,287.170000,307.590000,305.470000,310.580000,304.4,304.4,303.5
2,2012-10-01 14:00:00,284.629041,282.083252,289.474993,281.797217,291.868186,291.533501,293.403141,296.608509,285.154558,...,285.663208,288.247676,285.834650,287.186092,307.590000,304.310000,310.495769,304.4,304.4,303.5
3,2012-10-01 15:00:00,284.626998,282.091866,289.460618,281.789833,291.862844,291.543355,293.392177,296.631487,285.233952,...,285.756824,288.326940,285.847790,287.231672,307.391513,304.281841,310.411538,304.4,304.4,303.5
4,2012-10-01 16:00:00,284.624955,282.100481,289.446243,281.782449,291.857503,291.553209,293.381213,296.654466,285.313345,...,285.850440,288.406203,285.860929,287.277251,307.145200,304.238015,310.327308,304.4,304.4,303.5

In [8]:
pressure.head()

,datetime,Vancouver,Portland,San Francisco,Seattle,Los Angeles,San Diego,Las Vegas,Phoenix,Albuquerque,...,Philadelphia,New York,Montreal,Boston,Beersheba,Tel Aviv District,Eilat,Haifa,Nahariyya,Jerusalem
0,2012-10-01 12:00:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,1011.0,NaN,NaN,NaN
1,2012-10-01 13:00:00,NaN,1024.0,1009.0,1027.0,1013.0,1013.0,1018.0,1013.0,1024.0,...,1014.0,1012.0,1001.0,1014.0,984.0,1012.0,1010.0,1013.0,1013.0,990.0
2,2012-10-01 14:00:00,NaN,1024.0,1009.0,1027.0,1013.0,1013.0,1018.0,1013.0,1024.0,...,1014.0,1012.0,986.0,1014.0,984.0,1012.0,1010.0,1013.0,1013.0,990.0
3,2012-10-01 15:00:00,NaN,1024.0,1009.0,1028.0,1013.0,1013.0,1018.0,1013.0,1024.0,...,1014.0,1012.0,945.0,1014.0,984.0,1012.0,1010.0,1013.0,1013.0,990.0
4,2012-10-01 16:00:00,NaN,1024.0,1009.0,1028.0,1013.0,1013.0,1018.0,1013.0,1024.0,...,1014.0,1012.0,904.0,1014.0,984.0,1012.0,1010.0,1013.0,1013.0,990.0

In [9]:
wind_direction.head()

,datetime,Vancouver,Portland,San Francisco,Seattle,Los Angeles,San Diego,Las Vegas,Phoenix,Albuquerque,...,Philadelphia,New York,Montreal,Boston,Beersheba,Tel Aviv District,Eilat,Haifa,Nahariyya,Jerusalem
0,2012-10-01 12:00:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,360.0,NaN,NaN,NaN
1,2012-10-01 13:00:00,0.0,0.0,150.0,0.0,0.0,0.0,0.0,10.0,360.0,...,270.0,260.0,230.0,60.0,135.0,101.0,30.0,336.0,336.0,329.0
2,2012-10-01 14:00:00,6.0,4.0,147.0,2.0,0.0,0.0,8.0,9.0,360.0,...,270.0,260.0,230.0,60.0,157.0,315.0,30.0,336.0,336.0,329.0
3,2012-10-01 15:00:00,20.0,18.0,141.0,10.0,0.0,0.0,23.0,9.0,360.0,...,271.0,260.0,231.0,60.0,157.0,307.0,30.0,336.0,336.0,329.0
4,2012-10-01 16:00:00,34.0,31.0,135.0,17.0,0.0,0.0,37.0,9.0,360.0,...,272.0,260.0,233.0,60.0,157.0,294.0,30.0,336.0,336.0,329.0

In [10]:
wind_speed.head()

,datetime,Vancouver,Portland,San Francisco,Seattle,Los Angeles,San Diego,Las Vegas,Phoenix,Albuquerque,...,Philadelphia,New York,Montreal,Boston,Beersheba,Tel Aviv District,Eilat,Haifa,Nahariyya,Jerusalem
0,2012-10-01 12:00:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,8.0,NaN,NaN,NaN
1,2012-10-01 13:00:00,0.0,0.0,2.0,0.0,0.0,0.0,0.0,2.0,4.0,...,4.0,7.0,4.0,3.0,1.0,0.0,8.0,2.0,2.0,2.0
2,2012-10-01 14:00:00,0.0,0.0,2.0,0.0,0.0,0.0,0.0,2.0,4.0,...,4.0,7.0,4.0,3.0,3.0,0.0,8.0,2.0,2.0,2.0
3,2012-10-01 15:00:00,0.0,0.0,2.0,0.0,0.0,0.0,0.0,2.0,4.0,...,3.0,7.0,4.0,3.0,3.0,0.0,8.0,2.0,2.0,2.0
4,2012-10-01 16:00:00,0.0,0.0,2.0,0.0,0.0,0.0,0.0,2.0,4.0,...,3.0,7.0,4.0,3.0,3.0,0.0,8.0,2.0,2.0,2.0

In [11]:
city_att.head()

            City        Country   Latitude   Longitude
0      Vancouver         Canada  49.249660 -123.119339
1       Portland  United States  45.523449 -122.676208
2  San Francisco  United States  37.774929 -122.419418
3        Seattle  United States  47.606209 -122.332069
4    Los Angeles  United States  34.052231 -118.243683

In [12]:
weather_desc.head()

,datetime,Vancouver,Portland,San Francisco,Seattle,Los Angeles,San Diego,Las Vegas,Phoenix,Albuquerque,...,Philadelphia,New York,Montreal,Boston,Beersheba,Tel Aviv District,Eilat,Haifa,Nahariyya,Jerusalem
0,2012-10-01 12:00:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,haze,NaN,NaN,NaN
1,2012-10-01 13:00:00,mist,scattered clouds,light rain,sky is clear,mist,sky is clear,sky is clear,sky is clear,sky is clear,...,broken clouds,few clouds,overcast clouds,sky is clear,sky is clear,sky is clear,haze,sky is clear,sky is clear,sky is clear
2,2012-10-01 14:00:00,broken clouds,scattered clouds,sky is clear,sky is clear,sky is clear,sky is clear,sky is clear,sky is clear,sky is clear,...,broken clouds,few clouds,sky is clear,few clouds,sky is clear,sky is clear,broken clouds,overcast clouds,sky is clear,overcast clouds
3,2012-10-01 15:00:00,broken clouds,scattered clouds,sky is clear,sky is clear,sky is clear,sky is clear,sky is clear,sky is clear,sky is clear,...,broken clouds,few clouds,sky is clear,few clouds,overcast clouds,sky is clear,broken clouds,overcast clouds,overcast clouds,overcast clouds
4,2012-10-01 16:00:00,broken clouds,scattered clouds,sky is clear,sky is clear,sky is clear,sky is clear,sky is clear,sky is clear,sky is clear,...,broken clouds,few clouds,sky is clear,few clouds,overcast clouds,sky is clear,broken clouds,overcast clouds,overcast clouds,overcast clouds

### DATA DESCRIPTION

#### City

In [20]:
m = folium.Map(location=[39.5, -98.35], zoom_start=4, tiles='CartoDB positron')

# Thêm marker cho từng thành phố (không popup)
for _, row in city_att.iterrows():
    folium.CircleMarker(
        location=[row['Latitude'], row['Longitude']],
        radius=5,
        color='blue',
        fill=True,
        fill_color='blue',
        fill_opacity=0.6
    ).add_to(m)

# Lưu và hiển thị bản đồ
m.save('cities_only_map.html')

#### Humidity

In [10]:
# Kiểm tra kiểu dữ liệu và giá trị thiếu
humidity.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45253 entries, 0 to 45252
Data columns (total 37 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   datetime           45253 non-null  object
 1   Vancouver          43427 non-null  float64
 2   Portland           44804 non-null  float64
 3   San Francisco      44311 non-null  float64
 4   Seattle            44964 non-null  float64
 5   Los Angeles        45101 non-null  float64
 6   San Diego          44909 non-null  float64
 7   Las Vegas          44411 non-null  float64
 8   Phoenix            43945 non-null  float64
 9   Albuquerque        44543 non-null  float64
 10  Denver             43445 non-null  float64
 11  San Antonio        44689 non-null  float64
 12  Dallas             44934 non-null  float64
 13  Houston            45132 non-null  float64
 14  Kansas City        44741 non-null  float64
 15  Minneapolis        44743 non-null  float64
 16  Saint Louis        43964 non-null  float64
 17  Chicago            44144 non-null  float64
 18  Nashville          44686 non-null  float64
 19  Indianapolis       44558 non-null  float64
 20  Atlanta            44831 non-null  float64
 21  Detroit            44391 non-null  float64
 22  Jacksonville       45044 non-null  float64
 23  Charlotte          44664 non-null  float64
 24  Miami              44166 non-null  float64
 25  Pittsburgh         44731 non-null  float64
 26  Toronto            44525 non-null  float64
 27  Philadelphia       44629 non-null  float64
 28  New York           43629 non-null  float64
 29  Montreal           43557 non-null  float64
 30  Boston             44804 non-null  float64
 31  Beersheba          44394 non-null  float64
 32  Tel Aviv District  44140 non-null  float64
 33  Eilat              44283 non-null  float64
 34  Haifa              44435 non-null  float64
 35  Nahariyya          44436 non-null  float64
 36  Jerusalem          44347 non-null  float64
dtypes: float64(36), object(1)
memory usage: 12.8+ MB

In [14]:
# Mô tả thống kê cho toàn bộ thành phố (bỏ cột date)
desc_stats = humidity.drop(columns='datetime').describe()
print("\nThống kê mô tả:")
print(desc_stats)

Thống kê mô tả:
          Vancouver      Portland  San Francisco       Seattle   Los Angeles  \
count  43427.000000  44804.000000   44311.000000  44964.000000  45101.000000
mean      81.895480     74.697616      76.875042     77.159038     62.773841
std       14.522221     19.042656      17.396016     18.147464     21.818042
min       12.000000     10.000000       6.000000     13.000000      5.000000
25%       73.000000     63.000000      68.000000     66.000000     48.000000
50%       86.000000     80.000000      81.000000     81.000000     66.000000
75%       93.000000     90.000000      89.000000     93.000000     81.000000
max      100.000000    100.000000     100.000000    100.000000    100.000000

          San Diego     Las Vegas       Phoenix   Albuquerque        Denver  \
count  44909.000000  44411.000000  43945.000000  44543.000000  43445.000000
mean      67.784809     31.937831     37.484424     45.186157     53.022557
std       19.419307     20.041855     21.662728     23.336546     23.905392
min        5.000000      5.000000      5.000000      5.000000      5.000000
25%       56.000000     16.000000     21.000000     26.000000     33.000000
50%       71.000000     27.000000     32.000000     42.000000     52.000000
75%       82.000000     43.000000     50.000000     63.000000     73.000000
max      100.000000    100.000000    100.000000    100.000000    100.000000

       ...  Philadelphia      New York      Montreal        Boston  \
count  ...  44629.000000  43629.000000  43557.000000  44804.000000
mean   ...     68.017769     66.642417     71.861538     77.375301
std    ...     18.790524     19.874727     16.825027     18.750190
min    ...     10.000000     10.000000      7.000000     11.000000
25%    ...     54.000000     51.000000     60.000000     65.000000
50%    ...     68.000000     68.000000     74.000000     81.000000
75%    ...     84.000000     83.000000     86.000000     93.000000
max    ...    100.000000    100.000000    100.000000    100.000000

          Beersheba  Tel Aviv District         Eilat         Haifa  \
count  44394.000000       44140.000000  44283.000000  44435.000000
mean      70.604857          66.861509     53.155184     79.800383
std       21.321606          16.464177     27.305008     23.051692
min        5.000000           5.000000      5.000000      5.000000
25%       54.000000          58.000000     31.000000     63.000000
50%       77.000000          69.000000     48.000000     89.000000
75%       88.000000          78.000000     75.000000    100.000000
max      100.000000         100.000000    100.000000    100.000000

          Nahariyya     Jerusalem
count  44436.000000  44347.000000
mean      78.606760     68.732293
std       23.682244     19.273881
min        5.000000      5.000000
25%       61.000000     56.000000
50%       87.000000     70.000000
75%      100.000000     83.000000
max      100.000000    100.000000

[8 rows x 36 columns]

#### Pressure

In [18]:
pressure.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45253 entries, 0 to 45252
Data columns (total 37 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   datetime           45253 non-null  object
 1   Vancouver          41019 non-null  float64
 2   Portland           45249 non-null  float64
 3   San Francisco      44438 non-null  float64
 4   Seattle            45240 non-null  float64
 5   Los Angeles        45001 non-null  float64
 6   San Diego          45078 non-null  float64
 7   Las Vegas          45165 non-null  float64
 8   Phoenix            44659 non-null  float64
 9   Albuquerque        44797 non-null  float64
 10  Denver             44710 non-null  float64
 11  San Antonio        45236 non-null  float64
 12  Dallas             45193 non-null  float64
 13  Houston            45244 non-null  float64
 14  Kansas City        45132 non-null  float64
 15  Minneapolis        45236 non-null  float64
 16  Saint Louis        45185 non-null  float64
 17  Chicago            44528 non-null  float64
 18  Nashville          45106 non-null  float64
 19  Indianapolis       44964 non-null  float64
 20  Atlanta            45204 non-null  float64
 21  Detroit            45248 non-null  float64
 22  Jacksonville       45238 non-null  float64
 23  Charlotte          45250 non-null  float64
 24  Miami              44459 non-null  float64
 25  Pittsburgh         45207 non-null  float64
 26  Toronto            45078 non-null  float64
 27  Philadelphia       45249 non-null  float64
 28  New York           44212 non-null  float64
 29  Montreal           44259 non-null  float64
 30  Boston             45246 non-null  float64
 31  Beersheba          44447 non-null  float64
 32  Tel Aviv District  44323 non-null  float64
 33  Eilat              44461 non-null  float64
 34  Haifa              44455 non-null  float64
 35  Nahariyya          44458 non-null  float64
 36  Jerusalem          44454 non-null  float64
dtypes: float64(36), object(1)
memory usage: 12.8+ MB

In [20]:
# Mô tả thống kê cho toàn bộ thành phố (bỏ cột date)
desc_stats = pressure.drop(columns='datetime').describe()
print("\nThống kê mô tả:")
print(desc_stats)

Thống kê mô tả:
          Vancouver      Portland  San Francisco       Seattle   Los Angeles  \
count  41019.000000  45249.000000   44438.000000  45240.000000  45001.000000
mean    1018.130915   1019.268382    1018.843872   1021.001216   1015.912735
std       15.792425      9.943136       7.333477      9.737187     11.289701
min      807.000000    968.000000     985.000000    980.000000    886.000000
25%     1012.000000   1014.000000    1014.000000   1015.000000   1013.000000
50%     1017.000000   1019.000000    1018.000000   1020.000000   1016.000000
75%     1022.000000   1025.000000    1023.000000   1027.000000   1021.000000
max     1100.000000   1056.000000    1044.000000   1058.000000   1044.000000

          San Diego     Las Vegas       Phoenix   Albuquerque        Denver  \
count  45078.000000  45165.000000  44659.000000  44797.000000  44710.000000
mean    1017.524491   1013.659648   1013.297342   1012.292185   1011.976359
std        8.554904     18.893592     11.988782     39.049838     41.343487
min      964.000000    901.000000    884.000000    810.000000    800.000000
25%     1014.000000   1010.000000   1009.000000   1015.000000   1014.000000
50%     1017.000000   1015.000000   1014.000000   1021.000000   1020.000000
75%     1022.000000   1022.000000   1020.000000   1025.000000   1025.000000
max     1043.000000   1047.000000   1076.000000   1054.000000   1089.000000

       ...  Philadelphia      New York      Montreal        Boston  \
count  ...  45249.000000  44212.000000  44259.000000  45246.000000
mean   ...   1020.250193   1017.018977   1016.424953   1019.861314
std    ...      9.507596     10.125738      9.534390      9.548220
min    ...    824.000000    959.000000    822.000000    978.000000
25%    ...   1014.000000   1012.000000   1011.000000   1014.000000
50%    ...   1019.000000   1017.000000   1016.000000   1019.000000
75%    ...   1026.000000   1023.000000   1022.000000   1026.000000
max    ...   1059.000000   1052.000000   1054.000000   1054.000000

          Beersheba  Tel Aviv District         Eilat         Haifa  \
count  44447.000000       44323.000000  44461.000000  44455.000000
mean     991.172565        1013.815468   1002.039248   1017.550804
std       14.165100           6.476167     22.610353      7.500017
min      957.000000         929.000000    936.000000    999.000000
25%      985.000000        1010.000000   1002.000000   1012.000000
50%      988.000000        1013.000000   1010.000000   1017.000000
75%      994.000000        1018.000000   1016.000000   1024.000000
max     1099.000000        1039.000000   1040.000000   1042.000000

          Nahariyya     Jerusalem
count  44458.000000  44454.000000
mean    1015.901997   1011.034980
std       10.238495     12.951002
min      980.000000    981.000000
25%     1011.000000   1002.000000
50%     1017.000000   1012.000000
75%     1023.000000   1020.000000
max     1042.000000   1042.000000

[8 rows x 36 columns]

#### Temperature

In [21]:
temperature.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45253 entries, 0 to 45252
Data columns (total 37 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   datetime           45253 non-null  object
 1   Vancouver          44458 non-null  float64
 2   Portland           45252 non-null  float64
 3   San Francisco      44460 non-null  float64
 4   Seattle            45250 non-null  float64
 5   Los Angeles        45250 non-null  float64
 6   San Diego          45252 non-null  float64
 7   Las Vegas          45252 non-null  float64
 8   Phoenix            45250 non-null  float64
 9   Albuquerque        45252 non-null  float64
 10  Denver             45252 non-null  float64
 11  San Antonio        45252 non-null  float64
 12  Dallas             45249 non-null  float64
 13  Houston            45250 non-null  float64
 14  Kansas City        45252 non-null  float64
 15  Minneapolis        45240 non-null  float64
 16  Saint Louis        45252 non-null  float64
 17  Chicago            45250 non-null  float64
 18  Nashville          45251 non-null  float64
 19  Indianapolis       45246 non-null  float64
 20  Atlanta            45247 non-null  float64
 21  Detroit            45252 non-null  float64
 22  Jacksonville       45252 non-null  float64
 23  Charlotte          45250 non-null  float64
 24  Miami              44448 non-null  float64
 25  Pittsburgh         45250 non-null  float64
 26  Toronto            45252 non-null  float64
 27  Philadelphia       45250 non-null  float64
 28  New York           44460 non-null  float64
 29  Montreal           45250 non-null  float64
 30  Boston             45250 non-null  float64
 31  Beersheba          44455 non-null  float64
 32  Tel Aviv District  44460 non-null  float64
 33  Eilat              44461 non-null  float64
 34  Haifa              44455 non-null  float64
 35  Nahariyya          44456 non-null  float64
 36  Jerusalem          44460 non-null  float64
dtypes: float64(36), object(1)
memory usage: 12.8+ MB

In [ ]:
# Mô tả thống kê cho toàn bộ thành phố (bỏ cột date)
desc_stats = humidity.drop(columns='datetime').describe()
print("\nThống kê mô tả:")
print(desc_stats)

#### Wind direction

In [23]:
wind_direction.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45253 entries, 0 to 45252
Data columns (total 37 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   datetime           45253 non-null  object
 1   Vancouver          44458 non-null  float64
 2   Portland           45252 non-null  float64
 3   San Francisco      44459 non-null  float64
 4   Seattle            45252 non-null  float64
 5   Los Angeles        45252 non-null  float64
 6   San Diego          45252 non-null  float64
 7   Las Vegas          45248 non-null  float64
 8   Phoenix            45252 non-null  float64
 9   Albuquerque        45252 non-null  float64
 10  Denver             45252 non-null  float64
 11  San Antonio        45252 non-null  float64
 12  Dallas             45252 non-null  float64
 13  Houston            45251 non-null  float64
 14  Kansas City        45252 non-null  float64
 15  Minneapolis        45252 non-null  float64
 16  Saint Louis        45252 non-null  float64
 17  Chicago            45252 non-null  float64
 18  Nashville          45251 non-null  float64
 19  Indianapolis       45252 non-null  float64
 20  Atlanta            45252 non-null  float64
 21  Detroit            45252 non-null  float64
 22  Jacksonville       45248 non-null  float64
 23  Charlotte          45252 non-null  float64
 24  Miami              44458 non-null  float64
 25  Pittsburgh         45252 non-null  float64
 26  Toronto            45252 non-null  float64
 27  Philadelphia       45252 non-null  float64
 28  New York           44460 non-null  float64
 29  Montreal           45252 non-null  float64
 30  Boston             45252 non-null  float64
 31  Beersheba          44460 non-null  float64
 32  Tel Aviv District  44460 non-null  float64
 33  Eilat              44456 non-null  float64
 34  Haifa              44460 non-null  float64
 35  Nahariyya          44460 non-null  float64
 36  Jerusalem          44460 non-null  float64
dtypes: float64(36), object(1)
memory usage: 12.8+ MB

In [22]:
# Mô tả thống kê cho toàn bộ thành phố (bỏ cột date)
desc_stats = wind_direction.drop(columns='datetime').describe()
print("\nThống kê mô tả:")
print(desc_stats)

Thống kê mô tả:
          Vancouver      Portland  San Francisco       Seattle   Los Angeles  \
count  44458.000000  45252.000000   44459.000000  45252.000000  45252.000000
mean     159.892978    189.900071     209.299489    161.380226    139.549611
std       98.163221    102.873761      95.589055    103.206816    105.591486
min        0.000000      0.000000       0.000000      0.000000      0.000000
25%       80.000000    107.000000     160.000000     70.000000     29.000000
50%      140.000000    198.000000     232.000000    175.000000    140.000000
75%      236.000000    289.000000     280.000000    218.000000    230.000000
max      360.000000    360.000000     360.000000    360.000000    360.000000

          San Diego     Las Vegas       Phoenix   Albuquerque        Denver  \
count  45252.000000  45248.000000  45252.000000  45252.000000  45252.000000
mean     199.212852    176.320987    168.564351    199.878458    184.769005
std      106.350252    106.902903    107.533094    104.462490    104.705030
min        0.000000      0.000000      0.000000      0.000000      0.000000
25%      102.000000     94.000000     74.000000    125.000000    100.000000
50%      230.000000    180.000000    180.000000    210.000000    200.000000
75%      290.000000    255.000000    250.000000    292.000000    268.000000
max      360.000000    360.000000    360.000000    360.000000    360.000000

       ...  Philadelphia      New York      Montreal        Boston  \
count  ...  45252.000000  44460.000000  45252.000000  45252.000000
mean   ...    202.947008    196.250247    190.133541    184.915562
std    ...    102.323689    107.433676     99.033739    107.763589
min    ...      0.000000      0.000000      0.000000      0.000000
25%    ...    120.000000    104.000000    111.000000     80.000000
50%    ...    224.000000    220.000000    220.000000    210.000000
75%    ...    289.000000    289.000000    260.000000    272.000000
max    ...    360.000000    360.000000    360.000000    360.000000

          Beersheba  Tel Aviv District         Eilat         Haifa  \
count  44460.000000       44460.000000  44456.000000  44460.000000
mean     218.891206         171.459199    204.244691    196.070558
std      102.304924         121.843329    144.891439    112.498247
min        0.000000           0.000000      0.000000      0.000000
25%      112.000000          40.000000     40.000000    106.750000
50%      252.000000         184.000000    264.000000    224.000000
75%      309.000000         280.000000    345.000000    291.000000
max      359.000000         360.000000    360.000000    360.000000

          Nahariyya     Jerusalem
count  44460.000000  44460.000000
mean     194.901552    185.095592
std      111.983576    117.733600
min        0.000000      0.000000
25%      102.000000     68.000000
50%      223.000000    230.000000
75%      290.000000    287.000000
max      360.000000    360.000000

[8 rows x 36 columns]

#### Wind speed

In [25]:
wind_speed.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45253 entries, 0 to 45252
Data columns (total 37 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   datetime           45253 non-null  object
 1   Vancouver          44458 non-null  float64
 2   Portland           45252 non-null  float64
 3   San Francisco      44459 non-null  float64
 4   Seattle            45252 non-null  float64
 5   Los Angeles        45252 non-null  float64
 6   San Diego          45252 non-null  float64
 7   Las Vegas          45238 non-null  float64
 8   Phoenix            45251 non-null  float64
 9   Albuquerque        45249 non-null  float64
 10  Denver             45251 non-null  float64
 11  San Antonio        45252 non-null  float64
 12  Dallas             45251 non-null  float64
 13  Houston            45250 non-null  float64
 14  Kansas City        45252 non-null  float64
 15  Minneapolis        45250 non-null  float64
 16  Saint Louis        45252 non-null  float64
 17  Chicago            45252 non-null  float64
 18  Nashville          45250 non-null  float64
 19  Indianapolis       45252 non-null  float64
 20  Atlanta            45252 non-null  float64
 21  Detroit            45252 non-null  float64
 22  Jacksonville       45252 non-null  float64
 23  Charlotte          45251 non-null  float64
 24  Miami              44458 non-null  float64
 25  Pittsburgh         45252 non-null  float64
 26  Toronto            45252 non-null  float64
 27  Philadelphia       45251 non-null  float64
 28  New York           44460 non-null  float64
 29  Montreal           45252 non-null  float64
 30  Boston             45252 non-null  float64
 31  Beersheba          44460 non-null  float64
 32  Tel Aviv District  44459 non-null  float64
 33  Eilat              44461 non-null  float64
 34  Haifa              44458 non-null  float64
 35  Nahariyya          44459 non-null  float64
 36  Jerusalem          44459 non-null  float64
dtypes: float64(36), object(1)
memory usage: 12.8+ MB

In [24]:
# Mô tả thống kê cho toàn bộ thành phố (bỏ cột date)
desc_stats = wind_speed.drop(columns='datetime').describe()
print("\nThống kê mô tả:")
print(desc_stats)

Thống kê mô tả:
          Vancouver      Portland  San Francisco       Seattle   Los Angeles  \
count  44458.000000  45252.000000   44459.000000  45252.000000  45252.000000
mean       2.432746      2.050738       2.786702      2.118116      1.219548
std        2.004636      1.840815       2.284011      1.629988      1.434552
min        0.000000      0.000000       0.000000      0.000000      0.000000
25%        1.000000      1.000000       1.000000      1.000000      0.000000
50%        2.000000      1.000000       2.000000      2.000000      1.000000
75%        4.000000      3.000000       4.000000      3.000000      2.000000
max       25.000000     17.000000      43.000000     24.000000     17.000000

          San Diego     Las Vegas       Phoenix   Albuquerque        Denver  \
count  45252.000000  45238.000000  45251.000000  45249.000000  45251.000000
mean       1.751458      2.463482      1.909063      2.763685      2.438996
std        1.489450      2.318692      1.623629      2.300933      2.158956
min        0.000000      0.000000      0.000000      0.000000      0.000000
25%        1.000000      1.000000      1.000000      1.000000      1.000000
50%        1.000000      2.000000      1.000000      2.000000      2.000000
75%        2.000000      3.000000      3.000000      4.000000      3.000000
max       30.000000     19.000000     48.000000     22.000000     22.000000

       ...  Philadelphia      New York      Montreal        Boston  \
count  ...  45251.000000  44460.000000  45252.000000  45252.000000
mean   ...      2.643212      3.210954      3.831897      3.380889
std    ...      1.836347      2.189716      2.483430      2.277266
min    ...      0.000000      0.000000      0.000000      0.000000
25%    ...      1.000000      2.000000      2.000000      2.000000
50%    ...      2.000000      3.000000      3.000000      3.000000
75%    ...      3.000000      4.000000      5.000000      5.000000
max    ...     31.000000     25.000000     24.000000     20.000000

          Beersheba  Tel Aviv District         Eilat         Haifa  \
count  44460.000000       44459.000000  44461.000000  44458.000000
mean       1.989339           2.722306      3.452576      3.299406
std        1.462556           1.923380      2.323312      2.177502
min        0.000000           0.000000      0.000000      0.000000
25%        1.000000           1.000000      1.000000      2.000000
50%        1.000000           2.000000      3.000000      3.000000
75%        3.000000           4.000000      5.000000      4.000000
max       14.000000          49.000000     44.000000     19.000000

          Nahariyya     Jerusalem
count  44459.000000  44459.000000
mean       3.024292      1.880047
std        2.124482      1.712640
min        0.000000      0.000000
25%        1.000000      1.000000
50%        3.000000      1.000000
75%        4.000000      2.000000
max       17.000000     49.000000

[8 rows x 36 columns]